docs/git-internals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-03 Sun 19:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git-internals</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/zeroorone/style.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<meta name='theme-color' id='theme-color-meta' content='#f5f5f5'>
   <header>
    <nav class='breadcrumb'>
      <a href='/zeroorone/index.html'>Home</a>
      <span class='breadcrumb-sep'>/</span>
      <span class='breadcrumb-current'>git-internals</span>
    </nav>
    <div class='controls'>
      <button class='sidebar-toggle' title='Search'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M18.319 14.4326C20.7628 11.2941 20.542 6.75347 17.6569 3.86829C14.5327 0.744098 9.46734 0.744098 6.34315 3.86829C3.21895 6.99249 3.21895 12.0578 6.34315 15.182C9.22833 18.0672 13.769 18.2879 16.9075 15.8442C16.921 15.8595 16.9351 15.8745 16.9497 15.8891L21.1924 20.1317C21.5829 20.5223 22.2161 20.5223 22.6066 20.1317C22.9971 19.7412 22.9971 19.1081 22.6066 18.7175L18.364 14.4749C18.3493 14.4603 18.3343 14.4462 18.319 14.4326ZM16.2426 5.28251C18.5858 7.62565 18.5858 11.4246 16.2426 13.7678C13.8995 16.1109 10.1005 16.1109 7.75736 13.7678C5.41421 11.4246 5.41421 7.62565 7.75736 5.28251C10.1005 2.93936 13.8995 2.93936 16.2426 5.28251Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='theme-toggle' title='Toggle Theme'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M12 16C14.2091 16 16 14.2091 16 12C16 9.79086 14.2091 8 12 8V16Z' fill='currentColor'/>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2ZM12 4V8C9.79086 8 8 9.79086 8 12C8 14.2091 9.79086 16 12 16V20C16.4183 20 20 16.4183 20 12C20 7.58172 16.4183 4 12 4Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='toc-toggle' title='Table of Contents'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M2 6C2 5.44772 2.44772 5 3 5H21C21.5523 5 22 5.44772 22 6C22 6.55228 21.5523 7 21 7H3C2.44772 7 2 6.55228 2 6Z' fill='currentColor'/>
          <path d='M2 12.0322C2 11.4799 2.44772 11.0322 3 11.0322H21C21.5523 11.0322 22 11.4799 22 12.0322C22 12.5845 21.5523 13.0322 21 13.0322H3C2.44772 13.0322 2 12.5845 2 12.0322Z' fill='currentColor'/>
          <path d='M3 17.0645C2.44772 17.0645 2 17.5122 2 18.0645C2 18.6167 2.44772 19.0645 3 19.0645H21C21.5523 19.0645 22 18.6167 22 18.0645C22 17.5122 21.5523 17.0645 21 17.0645H3Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
  </header>

  <aside id='left-sidebar'>
    <div class='sidebar-header'>
      <h3>Search & Tags</h3>
      <button class='sidebar-close' title='Close'>
        <svg width='20' height='20' viewBox='0 0 15 15' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M11.7816 4.03157C12.0062 3.80702 12.0062 3.44295 11.7816 3.2184C11.5571 2.99385 11.193 2.99385 10.9685 3.2184L7.50005 6.68682L4.03164 3.2184C3.80708 2.99385 3.44301 2.99385 3.21846 3.2184C2.99391 3.44295 2.99391 3.80702 3.21846 4.03157L6.68688 7.49999L3.21846 10.9684C2.99391 11.193 2.99391 11.557 3.21846 11.7816C3.44301 12.0061 3.80708 12.0061 4.03164 11.7816L7.50005 8.31316L10.9685 11.7816C11.193 12.0061 11.5571 12.0061 11.7816 11.7816C12.0062 11.557 12.0062 11.193 11.7816 10.9684L8.31322 7.49999L11.7816 4.03157Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
    <div class='search-container'>
      <input type='text' id='sidebar-search' placeholder='Search full content or #tags...' autocomplete='off'>
    </div>
    <div id='sidebar-tags' class='tag-cloud'></div>
    <ul id='sidebar-results'></ul>
  </aside>
</div>
<div id="content" class="content">
<h1 class="title">git-internals</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd751de2">What happens inside .git/</a></li>
<li><a href="#orgb9bb931">So what are git objects?</a>
<ul>
<li>
<ul>
<li>
<ul>
<li><a href="#orge013f6e">Git's Content-Addressed Storage System</a></li>
<li><a href="#orgcaf1e96">How Git Avoids Duplication</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd1de585">So what is git index?</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd751de2" class="outline-2">
<h2 id="orgd751de2">What happens inside .git/</h2>
<div class="outline-text-2" id="text-orgd751de2">
<p>
Let's explore a <code>.git/</code> directory
</p>

<div class="org-src-container">
<pre class="src src-bash">ls -a .git
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Directory/File</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>objects/</code></td>
<td class="org-left">Stores all the Git objects (commits, blobs, trees, tags)</td>
</tr>

<tr>
<td class="org-left"><code>refs/</code></td>
<td class="org-left">Stores references to commits (like <code>main</code>)</td>
</tr>

<tr>
<td class="org-left"><code>HEAD</code></td>
<td class="org-left">Points to the current branch</td>
</tr>

<tr>
<td class="org-left"><code>config</code></td>
<td class="org-left">Local repo config</td>
</tr>

<tr>
<td class="org-left"><code>hooks/</code></td>
<td class="org-left">Scripts that run on certain Git events</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb9bb931" class="outline-2">
<h2 id="orgb9bb931">So what are git objects?</h2>
<div class="outline-text-2" id="text-orgb9bb931">
<p>
When you work with Git, every piece of your project's history is stored as something called a "Git object". To understand this better, imagine Git as a smart photo archive for your code. Every time you take a snapshot of your project using git commit, it stores the content of your files as individual photos (called blobs), records how your folders are organized (using trees), and writes a detailed caption describing when the snapshot was taken, who took it, and what changed (stored as commits). Each of these components gets a unique fingerprint so Git can find and reference them later.
</p>

<p>
Git runs every piece of content through a SHA-1 hash function, which produces a 40-character string that serves as that object's permanent ID. This hash is like a fingerprint where no two different pieces of content will ever produce the same hash, and the same content will always produce the exact same hash.
</p>

<p>
Wait, it doesn't stop there. Git doesn't just hash your raw file content. Before creating the hash, Git adds a small header that describes what type of object it is and how big the content is. For example, if you have a file containing "hello friend", Git first creates a string that looks like <code>blob 12\0hello friend</code> (where <code>blob</code> indicates the type, <code>12</code> is the number of characters, <code>\0</code> is a null separator, and then comes your actual content). Only then does it calculate the SHA-1 hash.
</p>
</div>
<div id="outline-container-orge013f6e" class="outline-5">
<h5 id="orge013f6e">Git's Content-Addressed Storage System</h5>
<div class="outline-text-5" id="text-orge013f6e">
<p>
Git operates as a content-addressed storage system. This means that instead of storing files by their names or locations, Git stores everything based on its content. The SHA-1 hash of each object serves as both its unique identifier and its storage address within the <code>.git/objects/</code> directory.
</p>

<p>
This means identical content is never stored twice. Git can quickly determine whether it already has a particular piece of content just by calculating its hash. And, if any stored content gets corrupted, its hash won't match anymore, and Git will know something went wrong.
</p>
</div>
</div>
<div id="outline-container-orgcaf1e96" class="outline-5">
<h5 id="orgcaf1e96">How Git Avoids Duplication</h5>
<div class="outline-text-5" id="text-orgcaf1e96">
<p>
Let's walk through a practical example to see how Git's deduplication works. Suppose you create a file called greeting.txt with the content "hello friend" and commit it to your repository. Git calculates the hash of this content and stores it as a blob object.
</p>

<p>
Later, you decide to create another file called message.txt with exactly the same content: "hello friend." When you add this new file to Git, something interesting happens. Git calculates the hash of the new file's content and discovers it's identical to the hash of the blob it created earlier. Instead of creating a new blob object, Git simply references the existing one.
</p>

<p>
From Git's perspective, both files point to the same blob object in its object database. The only thing that changes is the tree objects (which we'll explore later) that record the different filenames and their locations in your project structure. This means your Git repository stores the content "hello friend" only once, even though it appears in multiple files across potentially many commits.
</p>

<div class="org-src-container">
<pre class="src src-bash">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;     Commit         &#9474;
&#9474;--------------------&#9474;
&#9474; Author, Timestamp  &#9474;
&#9474; Message            &#9474;
&#9474; Points to &#8594; Tree   &#9474;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;    &#9474;
                          &#9660;
                 &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
                 &#9474;       Tree         &#9474;
                 &#9474;--------------------&#9474;
                 &#9474; <span class="org-string">"hello.txt"</span> &#8594; Blob &#9474;&#9668;&#9472;&#9488;
                 &#9474; <span class="org-string">"subdir/"</span>   &#8594; Tree &#9474;  &#9474;
                 &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;
                                         &#9660;
                        &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
                        &#9474;       Blob         &#9474;
                        &#9474;--------------------&#9474;
                        &#9474; File content only  &#9474;
                        &#9474; <span class="org-string">"hello friend"</span>     &#9474;
                        &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">What it Represents</th>
<th scope="col" class="org-left">Analogy</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>blob</code></td>
<td class="org-left">File content</td>
<td class="org-left">The actual photo of a file</td>
</tr>

<tr>
<td class="org-left"><code>tree</code></td>
<td class="org-left">Directory snapshot</td>
<td class="org-left">A folder, listing file names + blobs</td>
</tr>

<tr>
<td class="org-left"><code>commit</code></td>
<td class="org-left">A snapshot in time</td>
<td class="org-left">A pointer to the root tree + metadata</td>
</tr>

<tr>
<td class="org-left"><code>tag</code></td>
<td class="org-left">Named pointer</td>
<td class="org-left">A post-it stuck on a commit saying “v1.0”</td>
</tr>
</tbody>
</table>

<p>
So Git isn’t saving diffs. It saves the full structure of the project at each commit (with hashing and compression).
</p>
</div>
</div>
</div>
<div id="outline-container-orgd1de585" class="outline-2">
<h2 id="orgd1de585">So what is git index?</h2>
<div class="outline-text-2" id="text-orgd1de585">
<p>
Git index is like the shopping cart of your changes. 
 You can:
</p>
<ul class="org-ul">
<li>change your shopping list (working dir)</li>
<li>add items to your cart (index via <code>git add</code>)</li>
<li>remove items (<code>git restore --staged</code>)</li>
<li>checkout (<code>git commit</code>) to get your final receipt (commit object)</li>
</ul>


<p>
When you <code>git add</code> a file, Git:
</p>

<ol class="org-ol">
<li>Hash the content to get the blob hash</li>
<li>Store that blob in <code>.git/objects/</code> if it’s new</li>
<li>Add an entry to .git/index:
<ul class="org-ul">
<li>File path: file.txt</li>
<li>Blob SHA: (e.g., a8b1f8&#x2026;)</li>
<li>Metadata: permissions, size, timestamp</li>
</ul></li>
</ol>


<p>
Everything staged is stored in one binary file <code>.git/index</code>
It's structured like a table/list, with one entry per file, containing path, mode (permissions), SHA-1 hash (of blob)
timestamps and size, stage (for merge cases)
</p>

<div class="org-src-container">
<pre class="src src-text">.git/index
&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;   File Path   &#9474;  Mode  &#9474; Blob SHA &#9474;  Stage &#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
&#9474; file.txt      &#9474; 100644 &#9474; a8b1f8&#8230;  &#9474;    0   &#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9524;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9524;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9524;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</pre>
</div>

<blockquote>
<p>
The <code>Stage</code> is usually 0 (unless in a merge).
</p>
</blockquote>


<p>
git ls-files &#x2013;stage
git rev-list &#x2013;all &#x2013;objects
git cat-file -t e7fbc32     # Shows type (commit, tree, blob)
git cat-file -p e7fbc32     # Pretty-print the object
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Built with Emacs</p>
</div>
</body>
</html>
